test_data/hotel_property_desc_rq.xml

<soap-env:Envelope 
    xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:eb="http://www.ebxml.org/namespaces/messageHeader" 
    xmlns:xlink="http://www.w3.org/2001/xlink" 
    xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <soap-env:Header>
        <eb:MessageHeader soap-env:mustUnderstand="1" eb:version="2.0.0">
            <eb:From>
                <eb:PartyId type="urn:x12.org:IO5:01">www.z.com</eb:PartyId>
            </eb:From>
            <eb:To>
                <eb:PartyId type="urn:x12.org:IO5:01">webservices.sabre.com</eb:PartyId>
            </eb:To>
            <eb:CPAId>7TZA</eb:CPAId>
            <eb:ConversationId>fds8789h|dev@z.com</eb:ConversationId>
            <eb:Service eb:type="sabreXML">HotelPropertyDescription</eb:Service>
            <eb:Action>HotelPropertyDescriptionLLSRQ</eb:Action>
            <eb:MessageData>
                <eb:MessageId>mid:20180207-20:19:07.25|QVbg0</eb:MessageId>
                <eb:Timestamp>2018-02-16T07:18:42Z</eb:Timestamp>
            </eb:MessageData>
        </eb:MessageHeader>
        <wsse:Security 
            xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" 
            xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">
            <wsse:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/RESE!ICESMSLB\/RES.LB!-3177016070087638144!110012!0</wsse:BinarySecurityToken>
        </wsse:Security>
    </soap-env:Header>
    <soap-env:Body>
        <HotelPropertyDescriptionRQ Version="2.3.0" 
            xmlns="http://webservices.sabre.com/sabreXML/2011/10" 
            xmlns:xs="http://www.w3.org/2001/XMLSchema" 
            xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" ReturnHostCommand="true">
            <AvailRequestSegment>
                <GuestCounts Count="2"></GuestCounts>
                <HotelSearchCriteria>
                    <Criterion>
                        <HotelRef HotelCode="10"></HotelRef>
                    </Criterion>
                </HotelSearchCriteria>
                <TimeSpan End="04-05" Start="04-02"></TimeSpan>
            </AvailRequestSegment>
        </HotelPropertyDescriptionRQ>
    </soap-env:Body>
</soap-env:Envelope>